In [10]:
from tkinter import *

window = Tk()
window.title("Hello, NIET!")

label = Label(window, text ="Hello Students!", font=("Arial Bold", 20))
label.config(bg = "red", fg = "white")
label.pack()
window.mainloop()

In [11]:
from tkinter import *

window = Tk()
window.title("Hello, NIET!")

label = Label(window, text ="Hello Students!", font=("Arial Bold", 20))
label.config(bg = "red", fg = "white")
label.pack()
window.mainloop()

In [12]:
from tkinter import *

window = Tk()
window.title("Hello, NIET!")

label = Label(window, text ="Hello Students!", font=("Arial Bold", 20))
label.config(bg = "red", fg = "white")
label.pack(side="top", padx=40, pady=20)
window.mainloop()

In [13]:
from tkinter import *

# Create the main window which is an object of Tk class
window = Tk()
window.title("Hello, NIET!")

def button_clicked():
    buton.config(text="Good Job",bg = "red", fg = "white")
    
button = Button(window, text ="Hello Students! Click Me", command=button_clicked, font=("Arial Bold", 20))
button.config(bg = "red", fg = "white")
button.pack(side="top", padx=40, pady=20)

window.mainloop()

In [14]:
from tkinter import *

# Create the main window which is an object of Tk class
window = Tk()
window.title("Hello, NIET!")

def button_clicked():
    buton.config(text="Good Job",bg = "red", fg = "white")
    
button = Button(window, text ="Hello Students! Click Me", command=button_clicked, font=("Arial Bold", 20))
button.config(bg = "red", fg = "white")
button.pack(side="top", padx=40, pady=20)

window.mainloop()

In [15]:
import tkinter as tk

# Create the main window which is an object of Tk class
window = tk.Tk()
window.title("Scale Example")
window.geometry("800x200")
    
scale = tk.Scale(window, from_=0, to=100, orient=tk.HORIZONTAL)
scale.pack()

window.mainloop()

In [16]:
import tkinter as tk

# Create the main window which is an object of Tk class
window = tk.Tk()
window.title("Spinbox Example")
window.geometry("800x200")
    
scale = tk.Spinbox(window, from_=0, to=100)
scale.pack()

window.mainloop()

In [17]:
import tkinter as tk

window = Tk()
window.title("Checkbutton Example")
window.geometry("800x200")

check_var = tk.BooleanVar()
checkbutton = tk.Checkbutton(window, text="Check me", variable=check_var)
checkbutton.pack()

window.mainloop()

In [18]:
import tkinter as tk

window = Tk()
window.title("Radiobutton Example")
window.geometry("800x200")

radio_var = tk.StringVar()
radiobutton1 = tk.Radiobutton(window, text="Male", variable=radio_var, value="Male")
radiobutton2 = tk.Radiobutton(window, text="Female", variable=radio_var, value="Female")

radiobutton1.pack()
radiobutton2.pack()

window.mainloop()

In [19]:
import tkinter as tk

window = Tk()
window.title("Listbox Example")
window.geometry("800x200")

listbox = tk.Listbox(window)
listbox.insert(1, "Option 1")
listbox.insert(2, "Option 2")
listbox.insert(3, "Option 3")
listbox.pack()

window.mainloop()

In [20]:
import tkinter as tk
from tkinter.ttk import Combobox
from tkinter.ttk import Label

window = tk.Tk()
window.title("Combobox Example")
window.geometry("800x200")

def combobox_selected(event):
    selected_value = combobox_get()
    label.config(text=f"Selected: {selected_value}")
    
label = Label(window, text="Select an Option: ")
label.pack(padx=40, pady=20)

options = ["Option 1", "Option 2", "Option 3"]
combobox = Combobox(window, values=options)
combobox.pack(padx=40, pady=20)

combobox.bind("<<ComboboxSelected>>", combobox_selected)

window.mainloop()

In [21]:
from tkinter import *

window = tk.Tk()
window.title("String Example")
window.geometry("800x200")

label = Label(window, text="Enter here").pack(pady=10)
entry = Entry(window)
entry.pack()

window.mainloop()

In [22]:
from tkinter import *

window = Tk()
window.title("Login Form")

username_label = Label(window, text="Username: ")
username_label.pack(padx=40, pady=20)

password_label = Label(window, text="Password: ")  # ✅ Define it
password_label.pack(padx=40, pady=20)  
print(password_label)

.!label2

In [23]:
from tkinter import *
from tkcalendar import DateEntry

root = tk.Tk()
root.title("Date Picker Example")
root.geometry("800x200")

# Create a DateEntry widget
date_entry = DateEntry(root)
date_entry.pack()

root.mainloop()

In [24]:
import pandas as pd
import pandas as pd

ser_2 = pd.Series([1, 1, 2, -3, -5], index = ['a','b', 'c', 'd', 'e'])
print(ser_2)

a    1
b    1
c    2
d   -3
e   -5
dtype: int64

In [25]:
ser_2[ser_2 > 0]

a    1
b    1
c    2
dtype: int64

In [26]:
print(ser_2)
print(ser_2*2)

a    1
b    1
c    2
d   -3
e   -5
dtype: int64
a     2
b     2
c     4
d    -6
e   -10
dtype: int64

In [27]:
import numpy as np
np.exp(ser_2)

a    2.718282
b    2.718282
c    7.389056
d    0.049787
e    0.006738
dtype: float64

In [28]:
import pandas as pd

dict_1 = {'foo' : 100, 'bar' : 200, 'baz' : 300}
ser_3 = pd.Series(dict_1)
print(dict_1)
print(ser_3)

{'foo': 100, 'bar': 200, 'baz': 300}
foo    100
bar    200
baz    300
dtype: int64

In [29]:
import pandas as pd

index = {'foo', 'bar', 'baz', 'qux'}
ser_4 = pd.Series(dict_1, index=index)
ser_4

bar    200.0
baz    300.0
qux      NaN
foo    100.0
dtype: float64

In [30]:
pd.isnull(ser_4)

bar    False
baz    False
qux     True
foo    False
dtype: bool

In [31]:
print(ser_3)
print("----------------------------------------------------")
print(ser_4)
print("----------------------------------------------------")
print(ser_3+ser_4)
print("----------------------------------------------------")

foo    100
bar    200
baz    300
dtype: int64
----------------------------------------------------
bar    200.0
baz    300.0
qux      NaN
foo    100.0
dtype: float64
----------------------------------------------------
bar    400.0
baz    600.0
foo    200.0
qux      NaN
dtype: float64
----------------------------------------------------

In [32]:
ser_4.name = 'foobarbazqux'
ser_4.index.name = 'label'
ser_4

label
bar    200.0
baz    300.0
qux      NaN
foo    100.0
Name: foobarbazqux, dtype: float64

In [33]:
import pandas as pd

data_1 = {
    'state': ['VA', 'VA', 'VA', 'MD', 'MD'],
    'year':  [2010, 2011, 2012, 2010, 2011],
    'pop':   [5, 8, 5, 1, 5]  # ✅ Only 5 values
}
df_1 = pd.DataFrame(data_1)
print(data_1)
print('data_1')
print(df_1)

{'state': ['VA', 'VA', 'VA', 'MD', 'MD'], 'year': [2010, 2011, 2012, 2010, 2011], 'pop': [5, 8, 5, 1, 5]}
data_1
  state  year  pop
0    VA  2010    5
1    VA  2011    8
2    VA  2012    5
3    MD  2010    1
4    MD  2011    5

In [34]:
import pandas as pd


df_2 = pd.DataFrame(data_1, columns = ['year', 'state', 'pop'])
df_2

   year state  pop
0  2010    VA    5
1  2011    VA    8
2  2012    VA    5
3  2010    MD    1
4  2011    MD    5

In [35]:
import pandas as pd


df_3 = pd.DataFrame(data_1, columns = ['year', 'state', 'pop', 'unemp'])
df_3

   year state  pop unemp
0  2010    VA    5   NaN
1  2011    VA    8   NaN
2  2012    VA    5   NaN
3  2010    MD    1   NaN
4  2011    MD    5   NaN

In [36]:
df_3['state']

0    VA
1    VA
2    VA
3    MD
4    MD
Name: state, dtype: object

In [37]:
df_3.state

0    VA
1    VA
2    VA
3    MD
4    MD
Name: state, dtype: object

In [38]:
# Retrieve a row by position
print(df_3)
print("-------------------------------------------------")
print(df_3.iloc[1])

   year state  pop unemp
0  2010    VA    5   NaN
1  2011    VA    8   NaN
2  2012    VA    5   NaN
3  2010    MD    1   NaN
4  2011    MD    5   NaN
-------------------------------------------------
year     2011
state      VA
pop         8
unemp     NaN
Name: 1, dtype: object

In [39]:
# Assigning values to unemp column
df_3['unemp'] = np.arange(5)
df_3

   year state  pop  unemp
0  2010    VA    5      0
1  2011    VA    8      1
2  2012    VA    5      2
3  2010    MD    1      3
4  2011    MD    5      4

In [40]:
# Assigning a Series to unemp column
import pandas as pd

unemp1 = pd.Series([6.0, 6.0, 6.1], [2, 3, 4])
df_3['unemp'] = unemp1
df_3

   year state  pop  unemp
0  2010    VA    5    NaN
1  2011    VA    8    NaN
2  2012    VA    5    6.0
3  2010    MD    1    6.0
4  2011    MD    5    6.1

In [41]:
# Assigning same value to new column
df_3['state_dup'] = df_3['state']
df_3

   year state  pop  unemp state_dup
0  2010    VA    5    NaN        VA
1  2011    VA    8    NaN        VA
2  2012    VA    5    6.0        VA
3  2010    MD    1    6.0        MD
4  2011    MD    5    6.1        MD

In [42]:
# Deleting the column
del df_3['state_dup']
df_3

   year state  pop  unemp
0  2010    VA    5    NaN
1  2011    VA    8    NaN
2  2012    VA    5    6.0
3  2010    MD    1    6.0
4  2011    MD    5    6.1

In [43]:
# Creating a DataFrame from a dictionary
pop = {'VA' : {2013 : 5.1, 2014 : 5.2},
       'MD' : {2014 : 4.0, 2015: 4.1}
}
df_4 = pd.DataFrame(pop)
df_4

       VA   MD
2013  5.1  NaN
2014  5.2  4.0
2015  NaN  4.1

In [44]:
# Tranpose of DataFrame
df_4.T

    2013  2014  2015
VA   5.1   5.2   NaN
MD   NaN   4.0   4.1

In [45]:
# Creating a DataFrame from a dictionary of series
print(df_4)
data_2 = {'VA' : df_4['VA'][1:],
       'MD' : df_4['MD'][2:]
}
df_5 = pd.DataFrame(data_2)
df_5

       VA   MD
2013  5.1  NaN
2014  5.2  4.0
2015  NaN  4.1

       VA   MD
2014  5.2  NaN
2015  NaN  4.1

In [46]:
df_5.index.name = 'year'
df_5

       VA   MD
year
2014  5.2  NaN
2015  NaN  4.1

In [ ]:
import pandas as pd
ser_2 = pd.Series([1,2,-3,-5], index=["a",'b','c','d'])
ser_2[1:4]

b    2
c   -3
d   -5
dtype: int64

In [50]:
ser_2[0] == ser_2['a']

C:\Users\student\AppData\Local\Temp\ipykernel_10192\860172841.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  ser_2[0] == ser_2['a']

np.True_

In [ ]:
# All values with the strings
ser_2[['b','c','d']]

b    2
c   -3
d   -5
dtype: int64

In [ ]:
# All values greater than 2
ser_2[ser_2 > 0]

a    1
b    2
dtype: int64

In [58]:
# All values in the range
ser_2['a':'b'] # Endpoint is inclusive

a    1
b    2
dtype: int64

In [64]:
ser_2['a':'b'] = 0
ser_2

a    0
b    0
c   -3
d   -5
dtype: int64

In [76]:
print(df_5)
df_5[['VA', 'MD']]

       VA   MD
year
2014  5.2  NaN
2015  NaN  4.1

       VA   MD
year
2014  5.2  NaN
2015  NaN  4.1

In [83]:
print(df_5)
df_5[:1]

       VA   MD
year
2014  5.2  NaN
2015  NaN  4.1

       VA  MD
year
2014  5.2 NaN

In [92]:
print(df_5)
print("----------------------------------------------------------------------")
df_5_filtered = df_5[df_5["VA"] > 5]
print(df_5_filtered)

       VA   MD
year
2014  5.2  NaN
2015  NaN  4.1
----------------------------------------------------------------------
       VA  MD
year
2014  5.2 NaN

In [97]:
np.random.seed(0)
ser_6 = pd.Series(np.random.randn(5),
                  index=['a','b','c','d', 'e'])
ser_6

a    1.764052
b    0.400157
c    0.978738
d    2.240893
e    1.867558
dtype: float64

In [111]:
np.random.seed(1)
ser_7 = pd.Series(np.random.randn(5),
                  index=['a','c','e','f', 'g'])
ser_7

a    1.624345
c   -0.611756
e   -0.528172
f   -1.072969
g    0.865408
dtype: float64

In [112]:
ser_6+ser_7

a    3.388398
b         NaN
c    0.366982
d         NaN
e    1.339386
f         NaN
g         NaN
dtype: float64

In [113]:
ser_6.add(ser_7, fill_value=0)

a    3.388398
b    0.400157
c    0.366982
d    2.240893
e    1.339386
f   -1.072969
g    0.865408
dtype: float64

In [121]:
np.random.seed(0)
df_8 = pd.DataFrame(np.random.rand(9).reshape(3, 3),
                  columns=['a','b','c'])
df_8

          a         b         c
0  0.548814  0.715189  0.602763
1  0.544883  0.423655  0.645894
2  0.437587  0.891773  0.963663

In [120]:
np.random.seed(1)
df_9 = pd.DataFrame(np.random.rand(9).reshape(3, 3),
                  columns=['b','c','d'])
df_9

          b         c         d
0  0.417022  0.720324  0.000114
1  0.302333  0.146756  0.092339
2  0.186260  0.345561  0.396767

In [122]:
df_8+df_9

    a         b         c   d
0 NaN  1.132211  1.323088 NaN
1 NaN  0.725987  0.792650 NaN
2 NaN  1.078033  1.309223 NaN

In [123]:
df_10=df_8.add(df_9, fill_value=0)
df_10

          a         b         c         d
0  0.548814  1.132211  1.323088  0.000114
1  0.544883  0.725987  0.792650  0.092339
2  0.437587  1.078033  1.309223  0.396767

In [124]:
df_10=df_8.add(df_9, fill_value=1)
df_10

          a         b         c         d
0  1.548814  1.132211  1.323088  1.000114
1  1.544883  0.725987  0.792650  1.092339
2  1.437587  1.078033  1.309223  1.396767

In [127]:
df_10=df_8.add(df_9, fill_value=0)
df_10

          a         b         c         d
0  0.548814  1.132211  1.323088  0.000114
1  0.544883  0.725987  0.792650  0.092339
2  0.437587  1.078033  1.309223  0.396767

In [130]:
ser_8 = df_10.iloc[0]
print(ser_8)
df_11 = df_10 - ser_8
df_11

a    0.548814
b    1.132211
c    1.323088
d    0.000114
Name: 0, dtype: float64

          a         b         c         d
0  0.000000  0.000000  0.000000  0.000000
1 -0.003930 -0.406224 -0.530438  0.092224
2 -0.111226 -0.054178 -0.013864  0.396653

In [134]:
ser_9 = pd.Series(range(3), index=['a','d','e'])
ser_9

a    0
d    1
e    2
dtype: int64

In [137]:
print(df_11)
df_11 - ser_9

          a         b         c         d
0  0.000000  0.000000  0.000000  0.000000
1 -0.003930 -0.406224 -0.530438  0.092224
2 -0.111226 -0.054178 -0.013864  0.396653

          a   b   c         d   e
0  0.000000 NaN NaN -1.000000 NaN
1 -0.003930 NaN NaN -0.907776 NaN
2 -0.111226 NaN NaN -0.603347 NaN

In [136]:
print(df_11)
ser_9 - df_11

          a         b         c         d
0  0.000000  0.000000  0.000000  0.000000
1 -0.003930 -0.406224 -0.530438  0.092224
2 -0.111226 -0.054178 -0.013864  0.396653

          a   b   c         d   e
0  0.000000 NaN NaN  1.000000 NaN
1  0.003930 NaN NaN  0.907776 NaN
2  0.111226 NaN NaN  0.603347 NaN

In [140]:
print(df_10)
ser_10 = pd.Series([100, 200, 300])
ser_10

          a         b         c         d
0  0.548814  1.132211  1.323088  0.000114
1  0.544883  0.725987  0.792650  0.092339
2  0.437587  1.078033  1.309223  0.396767

0    100
1    200
2    300
dtype: int64

In [141]:
print(df_10)
df_10.sub(ser_10, axis=0)

          a         b         c         d
0  0.548814  1.132211  1.323088  0.000114
1  0.544883  0.725987  0.792650  0.092339
2  0.437587  1.078033  1.309223  0.396767

            a           b           c           d
0  -99.451186  -98.867789  -98.676912  -99.999886
1 -199.455117 -199.274013 -199.207350 -199.907661
2 -299.562413 -298.921967 -298.690777 -299.603233

In [143]:
print(df_10)
df_10.sub(ser_10, axis=1)
# Axis	Direction	    Operates Along	Common Use
# 0	    Top → Bottom	Rows	        Column-wise ops
# 1	    Left → Right	Columns	        Row-wise ops

          a         b         c         d
0  0.548814  1.132211  1.323088  0.000114
1  0.544883  0.725987  0.792650  0.092339
2  0.437587  1.078033  1.309223  0.396767

    a   b   c   d   0   1   2
0 NaN NaN NaN NaN NaN NaN NaN
1 NaN NaN NaN NaN NaN NaN NaN
2 NaN NaN NaN NaN NaN NaN NaN

In [145]:
print(df_11)
df_11 = np.abs(df_11)
df_11

          a         b         c         d
0  0.000000  0.000000  0.000000  0.000000
1  0.003930  0.406224  0.530438  0.092224
2  0.111226  0.054178  0.013864  0.396653

          a         b         c         d
0  0.000000  0.000000  0.000000  0.000000
1  0.003930  0.406224  0.530438  0.092224
2  0.111226  0.054178  0.013864  0.396653

In [147]:
print(df_11)
func_1 = lambda x: x.max() - x.min()
df_11.apply(func_1) # Apply on the dataframe df_11

          a         b         c         d
0  0.000000  0.000000  0.000000  0.000000
1  0.003930  0.406224  0.530438  0.092224
2  0.111226  0.054178  0.013864  0.396653

a    0.111226
b    0.406224
c    0.530438
d    0.396653
dtype: float64

In [148]:
print(df_11)
func_1 = lambda x: x.max() - x.min()
df_11.apply(func_1, axis=1)

          a         b         c         d
0  0.000000  0.000000  0.000000  0.000000
1  0.003930  0.406224  0.530438  0.092224
2  0.111226  0.054178  0.013864  0.396653

0    0.000000
1    0.526508
2    0.382789
dtype: float64

In [155]:
print(df_11)
func_2 = lambda x: pd.Series([x.min(), x.max()], index=['min', 'max'])
df_11.apply(func_2)

          a         b         c         d
0  0.000000  0.000000  0.000000  0.000000
1  0.003930  0.406224  0.530438  0.092224
2  0.111226  0.054178  0.013864  0.396653

            a         b         c         d
min  0.000000  0.000000  0.000000  0.000000
max  0.111226  0.406224  0.530438  0.396653